<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <author>caner</author>
  <title>MSP ler kitap yazdı !</title>
  <description>Windows Phone 8 İ&amp;ccedil;in Uygulama Geliştirme Rehberi
&amp;nbsp;

Microsoft Student Partners T&amp;uuml;rk</description>
  <content>&lt;p&gt;&lt;span style="font-size: medium;"&gt;&lt;strong&gt;Windows Phone 8 İ&amp;ccedil;in Uygulama Geliştirme Rehberi&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img style="float: right;" src="/MyImage_Folder/photo.PNG" alt="" width="347" height="485" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Microsoft Student Partners T&amp;uuml;rkiye ekibinin yaklaşık 1 yıldır &amp;uuml;zerinde &amp;ccedil;alıştığı Windows Phone 8 kitabı Ocak 2014&amp;prime;de yayınlandı. Hızlı değişim ve gelişim g&amp;ouml;steren teknoloji ile aynı anda &amp;ouml;ğrenmenin &amp;ccedil;ok zor olduğu bu d&amp;ouml;nemde MSP T&amp;uuml;rkiye ekibi &amp;uuml;lkemizde Windows Phone programlama &amp;ouml;ğrenme hızını biraz daha arttırabilmek amacıyla kolları sıvadı.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Windows Phone 8 i&amp;ccedil;in Uygulama Geliştirme Rehberi, MSP liderleri ve MSP&amp;rsquo;ler tarafından planlandı ve y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;. Liderler bu projede yer almak isteyen MSP&amp;rsquo;leri belirledi. G&amp;ouml;n&amp;uuml;ll&amp;uuml; olan &amp;ouml;ğrenciler ile kitapta yer alacak &amp;uuml;niteleri belirledikten sonra konular kişilere dağıtıldı ve bireysel &amp;ccedil;alışma aşamasına ge&amp;ccedil;ildi. Microsoft Virtual Academy, Channel9 gibi online eğitim sitelerinden kendi konuları ile ilgili teknik bilgiler toplayan MSP&amp;rsquo;ler bu bilgileri kendi tecr&amp;uuml;beleri ile birleştirerek yazıya d&amp;ouml;kt&amp;uuml;ler. Bu projeyi bir an &amp;ouml;nce sonu&amp;ccedil;landırabilmek i&amp;ccedil;in d&amp;uuml;zenli aralıklarla toplanıp projenin durumu g&amp;ouml;zden ge&amp;ccedil;irildi. Disiplini elden bırakmayan MSP T&amp;uuml;rkiye ekibi bu verimli &amp;ccedil;alışmasının meyvesini bu ay aldı ve rehber D&amp;amp;R ve İdefix gibi marketlerde yerini aldı.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Windows Phone 8 Uygulama Geliştirme Rehberi, Windows Phone 8 uygulaması geliştirmek isteyen birinin başka bir şeye ihtiyacı olmadan bu kitabı takip ederek kısa s&amp;uuml;rede Windows Phone 8 programlamayı &amp;ouml;ğrenmesini m&amp;uuml;mk&amp;uuml;n kılıyor. Tamamen T&amp;uuml;rk&amp;ccedil;e i&amp;ccedil;eriğe sahip bu kitap, Windows Phone sayfa tasarımı, harita kullanımı, uygulamanızın Windows Azure ile entegrasyonu gibi konularda bilgiler i&amp;ccedil;eren 23 b&amp;ouml;l&amp;uuml;mden oluşuyor. Windows Phone 8 Uygulama Geliştirme Rehberi&amp;rsquo;ne ulaşmak isterseniz&amp;nbsp;&lt;/span&gt;&lt;strong style="font-size: medium;"&gt;&lt;a href="http://www.pusula.com/pinfo.asp?pid=279"&gt;Pusula&lt;/a&gt;&lt;/strong&gt;&lt;span style="font-size: medium;"&gt;,&amp;nbsp;&lt;/span&gt;&lt;strong style="font-size: medium;"&gt;&lt;a href="http://www.dr.com.tr/kitap/windows-phone-8-%C4%B1cin-uygulama-gelistirme-rehberi//egitim-basvuru/bilgisayar/urunno=0000000577142"&gt;D&amp;amp;R&lt;/a&gt;&lt;/strong&gt;&lt;span style="font-size: medium;"&gt;&amp;nbsp;ve&amp;nbsp;&lt;/span&gt;&lt;strong style="font-size: medium;"&gt;&lt;a href="http://www.idefix.com/kitap/windows-phone-8-icin-uygulama-gelistirme-rehberi-kolektif/tanim.asp?sid=KQ55I75ONP1PEPIUSU2P"&gt;Idefix&lt;/a&gt;&lt;/strong&gt;&lt;span style="font-size: medium;"&gt;&amp;nbsp;linklerine tıklamanız yeterli!&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;</content>
  <ispublished>True</ispublished>
  <isdeleted>False</isdeleted>
  <iscommentsenabled>True</iscommentsenabled>
  <pubDate>2014-01-31 10:55:00</pubDate>
  <lastModified>2020-01-20 08:22:30</lastModified>
  <raters>0</raters>
  <rating>0</rating>
  <slug>MSP-ler-kitap-yazdı-!</slug>
  <tags>
    <tag>msp</tag>
    <tag>studentpartner</tag>
    <tag>wp8</tag>
    <tag>mspturkey</tag>
    <tag>wpbook</tag>
    <tag>wp kitap</tag>
  </tags>
  <comments />
  <categories>
    <category>5660c93a-7f12-4fdb-9aba-b7a2b128029f</category>
    <category>e8efc70d-b037-4f0c-9301-07808692337b</category>
  </categories>
  <notifications />
</post>