<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <author>caner</author>
  <title>11. IEEE Türkiye Öğrenci Kolları Ve Gold Kongresi - Kıbrıs'2013</title>
  <description>Sağdan akan trafik, devasa b&amp;uuml;y&amp;uuml;kl&amp;uuml;kte DAU kamp&amp;uuml;s&amp;uuml;, inanılmaz sıcaklık, merc</description>
  <content>&lt;p&gt;&lt;img style="float: left; margin: 6px;" src="/MyImage_Folder/ieee_kibris.JPG" alt="" width="328" height="328" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Sağdan akan trafik, devasa b&amp;uuml;y&amp;uuml;kl&amp;uuml;kte DAU kamp&amp;uuml;s&amp;uuml;, inanılmaz sıcaklık, mercedes taksiler ve yavru vatan kıprıs :)&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Yaklaşık 2 ay &amp;ouml;nce davetini aldığımız&amp;nbsp;11. IEEE T&amp;uuml;rkiye &amp;Ouml;ğrenci Kolları Ve Gold Kongresine &amp;Uuml;niversitemizde 10 yıldır faliyet g&amp;ouml;steren IEEE Student Branch ekibinden 4 arkadaşla birlikte ve &amp;Uuml;niversitemizden aldığımız her t&amp;uuml;rl&amp;uuml; maddi manevi destekle katılma fırsatımız oldu. Konferans salonları, konaklama, ulaşım, yemek vs. gibi b&amp;uuml;t&amp;uuml;n ihtiya&amp;ccedil;lar Doğu Akdeniz &amp;Uuml;niversitesi IEEE Student Branch ekibi tarafından organize edildi ve T&amp;uuml;rkiye'de bulunan &amp;ccedil;eşitli &amp;uuml;niversitelerden katılan yaklaşık 200'e yakın &amp;ouml;ğrencileri en iyi ve g&amp;uuml;zel şekilde ağırladılar. Kadir Has &amp;Uuml;niversitesi olarak kongre boyunca &amp;ccedil;eşitli oturumlar, workshop'lar, ve başta IEEE T&amp;uuml;rkiye temsilcisi olmak &amp;uuml;zre bir&amp;ccedil;ok se&amp;ccedil;im ve oylamalara katıldık. Farklı &amp;uuml;niversitelerden katılan bir&amp;ccedil;ok kişiyle tanışma fırsatımız oldu ve belkide bir daha hi&amp;ccedil; bozulmayacak arkadaş ilişkileri kurulmuş oldu.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Malum Kıbrıs'ta olduğumuzdan havanın ne derece sıcak olacağını daha gitmeden &amp;ouml;nce tahmin etmiştik ama inanın ne tahmin etmişsek 2 katı &amp;ccedil;ıktı. İnanılmaz bir sıcaklık vardı ve klima g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z anda sanki define bulmuş gibi sevinmiştik :)&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;&amp;Uuml;niversite Gazimağusa daydı ve bizde DAU Yurt 4'de konakladık. Kamp&amp;uuml;s inanılmaz derecede b&amp;uuml;y&amp;uuml;k ve y&amp;uuml;r&amp;uuml;yerek bir yere gidilmesi olduk&amp;ccedil;a zordu bizde herkesin yaptığı gibi taksiyle her yere gidip geldik. &amp;Uuml;cret olarak fena değil gibi 4-5 kişi bindiğinizde kişi başı max 3 TL gibi &amp;uuml;cret &amp;ouml;d&amp;uuml;yorsunuz.Yemek konusu biraz sıkıntılıydı pek bizim alışık olduğumuz gibi değildi, deniz kum &amp;amp; g&amp;uuml;neş 3'&amp;uuml; 1 arada muhteşemdi :) Son g&amp;uuml;n Girne'ye gittik ve orada bulunan savaş zamanından kalma birka&amp;ccedil; m&amp;uuml;zeyi gezdik,&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;span style="font-size: medium;"&gt;Ve daha nicesi..&lt;/span&gt;&lt;/p&gt;</content>
  <ispublished>True</ispublished>
  <isdeleted>False</isdeleted>
  <iscommentsenabled>True</iscommentsenabled>
  <pubDate>2013-07-07 17:14:00</pubDate>
  <lastModified>2020-01-20 08:22:31</lastModified>
  <raters>0</raters>
  <rating>0</rating>
  <slug>11-IEEE-Turkiye-Ogrenci-Kolları-Ve-Gold-Kongresi</slug>
  <tags>
    <tag>ieee</tag>
    <tag>kibris</tag>
    <tag>kongre</tag>
    <tag>dau</tag>
  </tags>
  <comments />
  <categories>
    <category>5660c93a-7f12-4fdb-9aba-b7a2b128029f</category>
  </categories>
  <notifications />
</post>