<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <author>caner</author>
  <title>Android'den fazla C# kodu yazılan Google Hackathon'u :)</title>
  <description>&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ODT&amp;Uuml; Teknokent, Google T&amp;uuml;rkiye ve Amerika Birleşik Devletleri B&amp;u</description>
  <content>&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&lt;span data-mce-mark="1"&gt;&amp;nbsp;&lt;img style="float: left;" src="/MyImage_Folder/IMG_1106.JPG" alt="" width="300" height="300" /&gt;&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;span data-mce-mark="1"&gt;&amp;nbsp; ODT&amp;Uuml; Teknokent, Google T&amp;uuml;rkiye ve Amerika Birleşik Devletleri B&amp;uuml;y&amp;uuml;kel&amp;ccedil;iliği iş birliği ile 16-17 Mayıs 2013 tarihinde Orta Doğu Teknik &amp;Uuml;niversitesi&amp;rsquo;nde ger&amp;ccedil;ekleşen &amp;ldquo;&lt;strong&gt;Social Entrepreneurship Hackathon&lt;/strong&gt;&amp;rdquo; adlı yarışmaya Kadir Has &amp;Uuml;niversitesi'ni temsilen 5 arkadaş katıldık.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;Aslında &amp;uuml;niversitede ki hocam &lt;span style="font-size: medium;" data-mce-mark="1"&gt;Sel&amp;ccedil;uk &amp;Ouml;ğrenci&lt;/span&gt; bana ilk "Android hackathon var gitmek ister misin ?" diye sorduğunda ilk başta "tabi hocam hemen giderim, nerede ne zaman ?.. " gibi konuştuktan sonra kendi kendime bi sordum "&lt;span style="text-decoration: underline;"&gt;Caner hayırdır ?.. Markette 16 tane uygulamam ver derken bu android market değil Windows Phone abicim...&lt;/span&gt;" falan filan derken bu d&amp;uuml;ş&amp;uuml;ncemi sonrasında Sel&amp;ccedil;uk hocamla da paylaştım ama o yinede benden katılmamı ve şakayla karışık takımın "&lt;span style="text-decoration: underline;"&gt;Core&lt;/span&gt;" denen şeysi olmamı s&amp;ouml;yledi :) &lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;"&gt;Bende emir b&amp;uuml;y&amp;uuml;k yerden deyip tamam hocam elimden gelen neyse &amp;uuml;st&amp;uuml;ne dahasını katarak arkadaşlara yardım edeceğimi s&amp;ouml;yledim. Neyse 15 Mayıs g&amp;uuml;n&amp;uuml; yola &amp;ccedil;ıktık ve yaklaşık 6-7 saat i&amp;ccedil;erisinde gece 23:15 gibi Ankara'ya vardık. Ankara dışından gelen &amp;ouml;ğrenciler TEDAS Misafirhanesi'nde konaklayacak diye s&amp;ouml;ylemişlerdi bizde geceyi orada ge&amp;ccedil;irdik.Sabah ODTU K&amp;uuml;lt&amp;uuml;r Merkezine ge&amp;ccedil;tik ve orada a&amp;ccedil;ılış konuşmasının olacağı salona gittik. Google T&amp;uuml;rkiye ekibinden, ODTU Teknopark ekibinden, ABD B&amp;uuml;y&amp;uuml;k el&amp;ccedil;iliğinden ve Teknoloji bakanlığından gelen konuşmacıları dinledikten sonra 2-3 saatlik bir ara verdik ve sonradan 22 saat s&amp;uuml;recek olan non-stop coding yani Hackathon başladı. Arkadaşlarla geliştirmeye karar verdiğimiz uygulamanın adı "&lt;strong&gt;EBS&lt;/strong&gt;" Engelli Bildiri Sistemi'ydi. Ne yapacaktı EBS ; aslında i&amp;ccedil;inde biraz Twitter biraz&amp;nbsp;Instagram olan bir uygulama gibi d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&lt;img style="font-family: verdana, geneva; font-size: small; float: right;" src="http://2.bp.blogspot.com/-Ri_QXNaaNYA/UMRPHQkmvgI/AAAAAAAADKc/6jGOg9MNhPw/s1600/engelliye+engel.jpg" alt="" width="248" height="248" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p style="padding-left: 30px; text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; Engelli vatandaşlara hizmet verecek olan uygulamanın ana işlevi şu şekilde olacak; diyelim ki engelli bir &amp;nbsp; vatandaşımız sokakta yolda giderken kendisine engel teşkil eden bir durumla karşılaştığında uygulamasını a&amp;ccedil;ıp lokasyon bilgisine g&amp;ouml;re bulunduğu yerin Belediyesi'ne Fotograf, A&amp;ccedil;ıklama, Yer Bilgilerini g&amp;ouml;ndererek engel hakkında bildiri/şikayet yapabiliyor olacaktı. Sağtarafta bulunan fotoğrafı uzun bir s&amp;uuml;re &amp;ouml;nce internette g&amp;ouml;rm&amp;uuml;şt&amp;uuml;m &amp;ouml;rnek olacağını d&amp;uuml;ş&amp;uuml;nerek paylaşmak istedim. Bu vatandaşımızı &amp;ouml;rnek alacak olduğumuzda ;&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; Engelli vatandaş bu karşılaştığı engel karşısında uygulamasını a&amp;ccedil;ıp sorumlu belediyeye sorunun fotoğrafını &amp;ccedil;ekip, a&amp;ccedil;ıklamasını yazıp g&amp;ouml;nder butonuna basacak ve bu bildiri Belediye nin sahip olduğu Web aray&amp;uuml;z&amp;uuml;ne d&amp;uuml;ş&amp;uuml;p g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenecek Belediye tarafından g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenecek ve sorun giderildiğinde o şikayeti yapan vatandaş mail yoluyla "Sorun giderilmiştir" şeklinde bilgilendirilecek.&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&amp;nbsp; &amp;nbsp; Aslında fikir bence gayet g&amp;uuml;zeldi &amp;ccedil;&amp;uuml;nk&amp;uuml; etkinliğin adı Sosyal Girişimcilik olduğundan uygulamanın i&amp;ccedil;eriği hem Sosyal olmalıydı ve toplumsal bir soruna parmak basıyor olması gerekiyordu.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="text-decoration: underline;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Yazılımsal olarak neler gerekli diye d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde ;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;ol style="text-align: left;"&gt;
&lt;li&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&amp;Ouml;ncelikle Server'da tutulan Sağlam bir &lt;strong&gt;Database&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Mobil uygulama ile iletişimi sağlayıp b&amp;uuml;t&amp;uuml;n ihtiya&amp;ccedil;lara cevap verecek iyi bir &lt;strong&gt;WebService&lt;/strong&gt;,&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Belediyeler tarafında gelen bildirimleri g&amp;ouml;r&amp;uuml;nt&amp;uuml;lemek i&amp;ccedil;in kullanılacak fonksiyonel bir &lt;strong&gt;Web Sayfası&lt;/strong&gt;.&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Ve tabi son olarak da &lt;strong&gt;Android&lt;/strong&gt; uygulaması :)&lt;/span&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;&lt;img style="float: right;" src="https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-ash3/922888_10151602162947432_2101549824_n.jpg" alt="" width="301" height="226" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; 1, 2 ve 3. şıklar benim yapacağım konulardı. İlk olarak &lt;strong&gt;MS-SQL&lt;/strong&gt; kullanarak kullanışlı bir Database geliştirdim ve bu Database'i &lt;strong&gt;Azure Cloud&lt;/strong&gt; servisimde sakladım. Sonrasında &lt;strong&gt;WCF&lt;/strong&gt; kullanarak json formatında yayın yapan bir adet Web Service geliştirdim. En son olarak da &lt;strong&gt;ASP.Net&lt;/strong&gt; kullanarak belediyeler i&amp;ccedil;in bir adet Web Sayfası geliştirdim. Şaka gibi ama b&amp;uuml;t&amp;uuml;n bunlar 6 saat i&amp;ccedil;erisinde bitmişti Hackathon bu olsa gerek&amp;nbsp;&lt;img title="Smile" src="http://www.canertosuner.com/editors/tiny_mce_3_5_8/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;.&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Android uygulaması &amp;uuml;zerinde &amp;ccedil;alışan arkadaşlar o sırada geliştirmeye devam ediyorlardı. 22 saatin sonunda maalesef arkadaşlar Android uygulamasını tam istediğimiz haliyle yetiştiremediler&amp;nbsp;&lt;img title="Frown" src="http://www.canertosuner.com/editors/tiny_mce_3_5_8/plugins/emotions/img/smiley-frown.gif" alt="Frown" border="0" /&gt;&amp;nbsp;Sunumumuzu yaptık ve sıralamaların a&amp;ccedil;ıklanmamıştı ve birincide olamamıştık.&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Aslında bi ara şey diye d&amp;uuml;ş&amp;uuml;nmedim değil; "&lt;strong&gt;Acaba &amp;ccedil;ok mu fazla Microsoft'u işin i&amp;ccedil;erisine soktum ?..&lt;/strong&gt;" &amp;ccedil;&amp;uuml;nk&amp;uuml; baktığımızda &amp;uuml;stte saydığım gibi yazılımsal olarak 4 adet g&amp;ouml;rev yada geliştirilecek yapı vardı ve bunlardan 3 tanesinde tamamiyle Microsoft'un izi vardı, &lt;span style="color: #ff0000;"&gt;&lt;strong&gt;MS-SQL Database, WCF WebService ve Asp.Net Web Sayfası :)&lt;/strong&gt;&lt;/span&gt; Etkinlik sonunda arkadaşlarla oturup bi baktığımızda şaka maka Android kodundan fazla C# vardı işin i&amp;ccedil;erisinde&amp;nbsp;&lt;img title="Cool" src="http://www.canertosuner.com/editors/tiny_mce_3_5_8/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Ama her şeye rağmen gayet g&amp;uuml;zel ve eğlenceli bir hackathon oldu, kişisel deneyim olarak bir &amp;ccedil;ok şey kazandım gibi zira &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki sene Microsoft'un her yıl d&amp;uuml;zenlediği &lt;strong&gt;Imagine Cup&lt;/strong&gt; yarışmasına katılmayı d&amp;uuml;ş&amp;uuml;n&amp;uuml;yordum ve bu deneyim benim i&amp;ccedil;in gerek sunum noktasında, gerek takım olarak &amp;ccedil;alışabilme konusunda gerekse işin sosyallik kısmında son derece katkıları oldu diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Umarım Sel&amp;ccedil;uk hoca bize ilerleyen zamanlarda da bu t&amp;uuml;r g&amp;ouml;revler paslar ve bizde okulumuzu (1. olamazsakda) en iyi şekilde temsil etmeye &amp;ccedil;alışırız&amp;nbsp;&lt;img title="Laughing" src="http://www.canertosuner.com/editors/tiny_mce_3_5_8/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: medium;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;&lt;iframe src="http://www.youtube.com/embed/YF3QmpvFMUc" width="560" height="315" frameborder="0"&gt;&lt;/iframe&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&amp;nbsp;&lt;/p&gt;</content>
  <ispublished>True</ispublished>
  <isdeleted>False</isdeleted>
  <iscommentsenabled>True</iscommentsenabled>
  <pubDate>2013-06-06 10:30:00</pubDate>
  <lastModified>2020-01-20 08:22:33</lastModified>
  <raters>10</raters>
  <rating>2.2</rating>
  <slug>Social-Entrepreneurship-Hackathon</slug>
  <tags>
    <tag>Social Entreprene</tag>
    <tag>google</tag>
    <tag>android</tag>
    <tag>c#</tag>
    <tag>azure</tag>
    <tag>odtu</tag>
    <tag>hackathon</tag>
    <tag>ankara</tag>
  </tags>
  <comments />
  <categories>
    <category>5660c93a-7f12-4fdb-9aba-b7a2b128029f</category>
  </categories>
  <notifications />
</post>