<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <author>caner</author>
  <title>Egosuz Programlama &amp; Programcı Egosu</title>
  <description>Biz developer'lar bazen yaptığımız iş gereği "dünyayı kurtarıyoruz" havasına girebiliyoruz (aslında sadece developer'lar değil test müh, analistler, tasarımcı arkadaşlar vs.). Sektörde her zaman bu gibi arkadaşlar hep varlar ve dehşet-ül vahşet düzeyde bir özgüven-ego patlaması yaşayabiliyorlar.Bu arkadaşlar istisnai olmadığı taktirde %99</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;Biz developer'lar bazen yaptığımız iş gereği "d&amp;uuml;nyayı kurtarıyoruz" havasına girebiliyoruz (aslında sadece developer'lar değil test m&amp;uuml;h, analistler, tasarımcı arkadaşlar vs.). Sekt&amp;ouml;rde her zaman bu gibi arkadaşlar hep varlar ve &lt;strong&gt;dehşet-&amp;uuml;l vahşet&lt;/strong&gt; d&amp;uuml;zeyde bir &amp;ouml;zg&amp;uuml;ven-ego patlaması yaşayabiliyorlar.Bu arkadaşlar istisnai olmadığı taktirde %99 oranında hep yazdıkları kodların veya ortaya attıkları tezlerin en iyisi olduğunu iddia ederler ve genelde "&lt;strong&gt;abi bundan daha iyi bir &amp;ccedil;&amp;ouml;z&amp;uuml;m yok yaa..&lt;/strong&gt;" gibi c&amp;uuml;mlelerle tanırız bu arkadaşları. Neden bu şekilde iddialı c&amp;uuml;mleler kurduklarını anlamak i&amp;ccedil;in bence biraz gerilere gidip bu arkadaşların staj d&amp;ouml;nemlerine inmek gerekir zira bu arkadaşlar &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k olasılıkla sağlam bir &lt;strong&gt;code review&lt;/strong&gt;'lık d&amp;ouml;nemini ka&amp;ccedil;ırmış olabilirler veya junior'lık d&amp;ouml;nemlerinde &lt;strong&gt;kodları inşaata ka&amp;ccedil;mış&lt;/strong&gt; olabilir :)&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img style="display: block; margin-left: auto; margin-right: auto;" src="/image.axd?picture=%2f2016%2f06%2faPy40Dw_700b.jpg" alt="" width="422" height="316" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Gereksiz ve anlamsızca ego sahibi olan bu arkadaşlar her şey hakkında en iyi ve en kabul g&amp;ouml;rebilir &amp;ouml;neriler sunduklarını d&amp;uuml;ş&amp;uuml;n&amp;uuml;rler, her ortamda teknik bilgilerini değişik bir jargonla anlatarak ortaya koymaya &amp;ccedil;alışırlar, en iyi kodu onlar yazmıştır ve eleştiriye kapalıdırlar. Bazen &amp;ouml;yle durumlar olur ki bir konu hakkında konuşuluyordur ve hi&amp;ccedil;bir fikri olmamasına rağmen sırf o konu hakkında expert olduğunu kanıtlamaya &amp;ccedil;alışmak adına tuhaf bir şekilde konuşmaya başlarlar. Tabiki de benim fikrim ancak bu arkadaşlarla kavgasız g&amp;uuml;r&amp;uuml;lt&amp;uuml;s&amp;uuml;z iletişim kurabilmenin en iyi yolu bu tarz hareketler yaptıklarını anladığınızda &amp;ouml;yle bir şey s&amp;ouml;yleyin ki bir daha benzeri hareketler yapmaya kalkışmasın. Bu tabii ki de k&amp;uuml;fretmek falan değil :) Ortaya koydukları tez'in sırf s&amp;ouml;ylemiş olmak i&amp;ccedil;in s&amp;ouml;ylediklerini d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorsanız ve siz daha doğru bir tez'e sahipseniz bu tezinizi savunmaktan kesinlikle &amp;ccedil;ekinmeyin ve onun tezini &amp;ccedil;&amp;uuml;r&amp;uuml;tmeye &amp;ccedil;alışın.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;B&amp;ouml;yle bir kişi eğer ekip arkadaşınızsa yani aynı projede beraber development yapıyorsanız şu gibi c&amp;uuml;mleler duymanız hi&amp;ccedil; zor değil "abi burayı b&amp;ouml;yle yazmasak daha iyi yaa..", "abi ben daha &amp;ouml;nce bunla ilgili &amp;ccedil;ok kral bi &amp;ccedil;&amp;ouml;z&amp;uuml;m bulmuştum yaa..","bu b&amp;ouml;ylemi yapılır yaa.." falanlar filanlar. Bu gibi c&amp;uuml;mleler kuran bir ekip arkadaşınız var ise ve y&amp;uuml;ksek oranda ego sahibi olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorsanız benzer c&amp;uuml;mleler kurmasının asıl amacı &amp;uuml;st&amp;uuml;nl&amp;uuml;k sağlamaya &amp;ccedil;alışmak veya benzer bir kodu oda yazmıştır zamanında ve o yazdığının ilelebet en iyi &amp;ccedil;&amp;ouml;z&amp;uuml;m olacağını d&amp;uuml;ş&amp;uuml;n&amp;uuml;r &amp;ccedil;&amp;uuml;nk&amp;uuml; ezberlemiştir onun i&amp;ccedil;in hep bildiği yoldan gitmek gerekmektedir ve senide ısrarla o yola sokmaya &amp;ccedil;alışır.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Evet malesef bende bu arkadaşlardan biriyle bir s&amp;uuml;reliğine &amp;ccedil;alışmak zorunda kaldım ve yaşadığım bir &amp;ouml;rneği vermeden ge&amp;ccedil;emicem. Eski &amp;ccedil;alıştığım şirkette bir mobil projesini geliştirme yapan arkadaştan devraldım ve geliştirmeye ben devam edecektim kendisi başka bir &amp;nbsp;departmana ge&amp;ccedil;mişti. Projeyi devraldığımda markette bulunan versiyonu yanılmıyorsam 1.1 di ve ben yaklaşık 2 sene o projede &amp;ccedil;alışmıştım. 2 sene dolmasına yakın bir d&amp;uuml;n bu arkadaş burnu 5 karış kalkık vaziyette yanıma geldi ve ne hikmettir bilmem proje hakkında sorular sormaya başladı.Sorulardan biride uygulamanın bir sonraki versiyonunun ne olacağıydı. Bende 3.0 olacağını s&amp;ouml;yledim.O arkadaş sahip olduğun egoyla ş&amp;ouml;yle bir c&amp;uuml;mle kullandı "&lt;strong&gt;Ben sana bişey s&amp;ouml;ylimmi siz bu versiyonlamayı kesin yanlış yapıyorsunuz...&lt;/strong&gt;" bende dedim ki "&lt;strong&gt;wtf..? yani ne alaka nerden &amp;ccedil;ıkardın bunu ?&lt;/strong&gt;" oda "&lt;strong&gt;ben bu projeyi bıraktığımda v1.1 di..&lt;/strong&gt;" arkadaş zannediyordu ki kendisi uygulamanın %25 inin geliştirmesini yapıp v1.1 ile markete &amp;ccedil;ıkıp uygulama bitmişti. Geriye kalan 2 sene i&amp;ccedil;erisinde uygulamanın %85'e yakının geliştirilip 6 defa update &amp;ccedil;ıkıldığından haberi yok, haberi olmasa daha d&amp;uuml;ş&amp;uuml;nmesine de gerek yok &amp;ccedil;&amp;uuml;nk&amp;uuml; 2 sene &amp;ouml;nce o uygulamayı yaptı ve bitti. Ben naptım peki ? Bir g&amp;uuml;zel o kişiye konuyu a&amp;ccedil;ıklayıp arkasını d&amp;ouml;n&amp;uuml;p fıtı fıtı gidişini izleyerek &amp;ccedil;ayımı yudumladım.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Malesef ego sahibi insanlar IT sekt&amp;ouml;r&amp;uuml;nde hep olacaktır, bu insanlar yarın bir g&amp;uuml;n bizlerde olabiliriz ama sahip olduğumuz ego'nun makul d&amp;uuml;zeyde olması &amp;ccedil;ok &amp;ouml;nemli.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Peki ger&amp;ccedil;ekten biz developer'lar makul d&amp;uuml;zeyde ego'ya nasıl sahip olabiliriz, neler yapmalıyız ..? Bununla ilgili bilgisayar bilimleri i&amp;ccedil;in bir &amp;ccedil;ok makale yayınlamış olan yazar&amp;nbsp;&lt;strong&gt;Gerard M. Weinberg&amp;nbsp;"Egoless Programming"&amp;nbsp;&lt;/strong&gt;adında bir makale yazıyor&lt;strong&gt;. &lt;/strong&gt;&amp;Uuml;stad konu ile ilgili yaklaşık 40 yıl &amp;ouml;nce 10 tane kural tanımlamış. Bunlar;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;1. Understand and accept that you will make mistakes&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;T&amp;uuml;rk&amp;ccedil;esi "herkes gibi sende hata yapacaksın arkadaş bunu anla ve kabul et.." diyor. Bug'ı olmayan uygulama olmaz ve her zaman uygulamalarda exception'lar meydana gelecektir. &amp;Ouml;nemli olan bu gibi durumlar production'ı etkilemeden yakalayıp m&amp;uuml;dahale edip uygulamamızı hatalardan arındırmaktır. Tabi bug'ları ortaya &amp;ccedil;ıkartmak i&amp;ccedil;inde &amp;ccedil;ok iyi test s&amp;uuml;re&amp;ccedil;leri gerekmektedir.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;2. You are not your code&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Review yapmanın asıl amacının meydana gelmiş veya gelecek olan problemleri bulmak olduğun hatırla ve problemler olacaktır da. Review sırasında birisi projenizde herhangi bir problem bulduğunda veya eleştirel bir yorumda bulunduğunda bunu kişisel bir şey olarak algılama ve sadece geliştirme yapmaya devam et.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;h3&gt;&lt;span style="font-size: small;"&gt;3. No matter how much you know, someone else will always know more&lt;/span&gt;&lt;/h3&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Hi&amp;ccedil; kimse ben iyi programcıyım dememelidir. Her zaman i&amp;ccedil;in herkesin farklı bakış a&amp;ccedil;ısından sorunları analiz edip &amp;ccedil;&amp;ouml;z&amp;uuml;mler &amp;uuml;rettiğini d&amp;uuml;ş&amp;uuml;nmek gerekir ve buda her zaman i&amp;ccedil;in daha iyisinin olabileceği ger&amp;ccedil;eğini unutmamamız gerektiğini işaret eder. Sahip olduğumuz bilgi ve beceriler tabiki &amp;ccedil;ok değerli ancak bunun da bir limitinin olduğunu bilmemiz gerekir. Geliştirme yaparken her developer'ın izlediği farklı bir yol olabilir ve daha &amp;ouml;nce senin hi&amp;ccedil; bilmediğin-denemediğin bir şekilde sorunları &amp;ccedil;&amp;ouml;z&amp;uuml;yor olabilir ve bu gibi case'leri &amp;ccedil;ok fazla abartıp sidik yarışına girmeye gerek yoktur. Sadece şunu bilmek gerekir her zaman senden daha farklı veya senden daha iyisini bilen biri olacaktır.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;4.&amp;nbsp;Don&amp;rsquo;t rewrite code without consultation&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Bu kural bize kodu fix etme ile yeniden yazma arasında ince bir &amp;ccedil;izgi olduğundan bahsediyor. Bu farkı iyi bir şekilde bil ve değişiklik yapacağın yerlerde core koda dokunup projeyi yeniden geliştirmene neden olacak şeylerden uzak dur.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;5.&amp;nbsp;Treat people who know less than you with respect, deference, and patience&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Ekibinde veya etrafında her zaman senin kadar teknik bilgisi olmayan insanlar olacaktır. Bunlara karşı anlayışlı ve saygılı olmaya &amp;ccedil;alış. Eğer m&amp;uuml;mk&amp;uuml;nse onlara konudan bahset ve teknik tarafını anlamada yardımcı ol.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;6.&amp;nbsp;The only constant in the world is change&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Değişim yazılım d&amp;uuml;nyasında ka&amp;ccedil;ınılmazdır ve değişime a&amp;ccedil;ık ol ve geldiğinde g&amp;uuml;l&amp;uuml;mseyerek kabul et :) İstenilen değişikliği bir challenge olarak g&amp;ouml;r ve kendine yeni bir şeyler katacağını d&amp;uuml;ş&amp;uuml;nerekten hareket et.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;7.&amp;nbsp;The only true authority stems from knowledge, not from position&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Belli konular hakkında bilgi sahibi olmak beraberinde yetkili olmayı da gerektirir ve yetkide beraberinde saygılı olmayı getirir. Eğer egosuz bir ortamda saygı istiyorsan &amp;ouml;ncelikle bilgi &amp;uuml;retmen gerekir.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;8.&amp;nbsp;&lt;/strong&gt;&lt;strong&gt;Fight for what you believe, but gracefully accept defeat&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Bazen sahip olduğunuz fikirlerin veya ortaya attığınız tezlerin reddedilebileceği ger&amp;ccedil;eğini unutmayın bu her zaman ihtimal dahilindedir. Bazen haklı olduğun durumlarda bile asla intikam almaya &amp;ccedil;alışmayın hatta "ben sana demiştim.." vs gibi şeyler dahi s&amp;ouml;ylememeye &amp;ouml;zen g&amp;ouml;sterin.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;9.&amp;nbsp;&lt;/strong&gt;&lt;strong&gt;Don&amp;rsquo;t be the &amp;ldquo;coder in the corner&amp;rdquo;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Ofisin en karanlık k&amp;ouml;şesinde oturup mesai saati boyunca sadece kişisel ihtiya&amp;ccedil;larını karşılamak i&amp;ccedil;in yerinden kalkan kişi olmayın &amp;ccedil;&amp;uuml;nk&amp;uuml; o developer g&amp;ouml;zden uzak olduğu gibi g&amp;ouml;n&amp;uuml;lden de ırak olur. Her zaman i&amp;ccedil;in ofis i&amp;ccedil;inde olup bitenlerden haberiniz olsun ve her zaman kendinizi ekibinizin ve şirketinizin bir par&amp;ccedil;ası olarak g&amp;ouml;r&amp;uuml;n.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;10.&amp;nbsp;&lt;/strong&gt;&lt;strong&gt;Critique code instead of people &amp;ndash; be kind to the coder, not the code&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;M&amp;uuml;mk&amp;uuml;n olduğunca yazacağın yorum satırlarında pozitif bir dil kullanmaya &amp;ccedil;alış ve yorumlarında d&amp;uuml;nyaları yeniden yarattığından &amp;ccedil;ok kod kalitesinin gelişimine y&amp;ouml;nelik a&amp;ccedil;ıklamalarda bulun. Yorum standartlarınız standart olup resmi bir dil kullanmaya &amp;ouml;zen g&amp;ouml;sterin ve her zaman i&amp;ccedil;in projeye sizden sonra gelecek olan kişiyi d&amp;uuml;ş&amp;uuml;n&amp;uuml;n.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;Yazının başında da bahsettiğim gibi ego makul d&amp;uuml;zeyde olduğu s&amp;uuml;rece g&amp;uuml;zeldir. Yaptığımız işlerle &amp;ouml;v&amp;uuml;n&amp;uuml;rken başkalarını ezme d&amp;uuml;ş&amp;uuml;ncesine girmemeliyiz ve bırakın başkaları bizi &amp;ouml;vs&amp;uuml;n. B&amp;ouml;yle olduğu taktirde &amp;ccedil;alışma hayatı hem siz hemde &amp;ccedil;alışma arkadaşlarınız i&amp;ccedil;in daha eğlenceli ve &amp;ccedil;ekilesi olacaktır.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;</content>
  <ispublished>True</ispublished>
  <isdeleted>False</isdeleted>
  <iscommentsenabled>True</iscommentsenabled>
  <pubDate>2016-06-08 21:00:00</pubDate>
  <lastModified>2020-01-20 08:22:24</lastModified>
  <raters>0</raters>
  <rating>0</rating>
  <slug>Egosuz-Programlama-Egoless-Programming</slug>
  <tags>
    <tag>Egoless Programming</tag>
    <tag>developers</tag>
    <tag>programmers</tag>
    <tag>Gerard M. Weinberg</tag>
    <tag>ego</tag>
    <tag>Computer Programmers</tag>
    <tag>Word Definitions</tag>
    <tag>Terminology</tag>
    <tag>and Jargon</tag>
    <tag>Programming Languages</tag>
    <tag>Computer Programming</tag>
  </tags>
  <comments />
  <categories>
    <category>ebe6cacc-3d21-4b1a-87de-e73b59b91a82</category>
  </categories>
  <notifications />
</post>