<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <author>caner</author>
  <title>Microsoft Student Partner Programına Seçildim.</title>
  <description>Microsoft'un &amp;ouml;ğrenciler i&amp;ccedil;in olan "Microsoft Student Partner" programına se&amp;ccedil;ildim</description>
  <content>&lt;p&gt;&lt;strong&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Microsoft'un &amp;ouml;ğrenciler i&amp;ccedil;in olan "Microsoft Student Partner" programına se&amp;ccedil;ildim&amp;nbsp;&lt;img title="Smile" src="/editors/tiny_mce_3_5_8/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&lt;img style="float: left; margin: 5px 10px 5px 10px;" src="http://4.bp.blogspot.com/-_TadizWuwuE/UHoENj9SuEI/AAAAAAAABJY/AlmHdzRgW40/s1600/msp.jpg" alt="" width="293" height="220" /&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;"&lt;strong&gt;The Begining Of a Dream..&lt;/strong&gt;" MSP programını ilk olarak ge&amp;ccedil;en yıl &amp;ouml;nce bu zamanlar duymuştum ve o zaman tam olarak nedir ne değildir bilmiyordum, kısa bir araştırmanın ardından &amp;ouml;ğrenciler i&amp;ccedil;in ka&amp;ccedil;ınılmaz bir fırsat olduğunu &amp;ouml;ğrendim ve koyuldum yollara :) Başvuru i&amp;ccedil;in neler gerekli ?, nasıl başvuru yapılır ? gibi soruların cevabını bulduktan sonra başvuru tarihini beklemeye koyuldum. Ge&amp;ccedil;en yaz tatilinde Amerika'daydım ve s&amp;uuml;rekli olarak her hafta yaptığım şey Microsoft Kamp&amp;uuml;s T&amp;uuml;rkiye Facebook &lt;strong&gt;&lt;a href="https://www.facebook.com/mskampus"&gt;sayfasına&lt;/a&gt;&amp;nbsp;&lt;/strong&gt;girip başvurular başladı mı başlamadı mı diye kontrol etmekti. Aslında gitmeden &amp;ouml;nce her şeyi hazırlamıştım *Başvuru formunu doldururken gerekli bilgiler, referans olarak g&amp;ouml;stereceğim kişi hatta başvurular sırasında istenen tanıtım videosunun metnini bile yazmıştım ve &lt;strong&gt;Time Square&lt;/strong&gt;' de &amp;nbsp;başvuru videosunu &amp;ccedil;ekmiştim&amp;nbsp;&lt;img title="Cool" src="/editors/tiny_mce_3_5_8/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;Yani tek gereken şey başvurular a&amp;ccedil;ıldığında başvuru yapması kalmıştı. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Gel gelelim yaz sonuna kadar bir t&amp;uuml;rl&amp;uuml; başvurulara denk gelemedim ve Eyl&amp;uuml;l ayının sonunda T&amp;uuml;rkiye'ye d&amp;ouml;nd&amp;uuml;m ve dersler başladıktan yaklaşık 2,5 ay sonra bir pazar akşamı misafirliğe gittiğim bir yerde gece saat 23:30 gibi facebook'da gezinirken&amp;nbsp;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&lt;a href="https://www.facebook.com/mskampus"&gt;Microsoft Kamp&amp;uuml;s T&amp;uuml;rkiye Facebook&lt;/a&gt;&amp;nbsp;sayfasına girdim birde ne g&amp;ouml;reyim "&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&lt;span style="text-decoration: underline;"&gt;Yeni D&amp;ouml;nem MSP başvuruları i&amp;ccedil;in son 24 saa&lt;/span&gt;t&lt;/span&gt;" yazıyordu ve 24 saatin dolmasına tam 30 dkka vardı.Hemen başvuru linkine tıklayıp formda bulunan 10-12 soruyu hızlıca doldurdum ve en &amp;ccedil;ok korktuğum şey video konusunda herhangi bir şey istememeleriydi ve son olarak da başvurumdan &amp;uuml;niversitede g&amp;ouml;revli olan bir hocamızın bilgisi olması şartıydı, hemen alelacele Taner hocaya e-mail atıp konu hakkında bilgilendirdim ve o da hemen cevap verip kendisinin ismini yazabileceğimi s&amp;ouml;yledi. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;Neyse başvuruyu yapmıştım ve yaklaşık 1 ay i&amp;ccedil;erisinde sonu&amp;ccedil;lar a&amp;ccedil;ıklandı ve o d&amp;ouml;nem yeni bir sisteme gidilerek ilk başvuran &amp;ouml;ğrencileri programa "Candidate" yani Aday olarak kabul etmişlerdi haliyle bende bir &lt;span style="font-size: medium;" data-mce-mark="1"&gt;Microsoft Student Partner Candidate&lt;/span&gt; se&amp;ccedil;ildim.Sonrasında &amp;ccedil;eşitli toplantılar ve etkinlikler d&amp;uuml;zenledik, &amp;ccedil;eşitli eğitimler Microsoft Office'de şahane etkinlikler ve birde Bilgi &amp;Uuml;niv. Santral'de bir gece sabaha kadar Code-Night yapmıştık. Şahane bir duyguydu sabahlara kadar None-Stop coding :) MSP se&amp;ccedil;ilebilmek i&amp;ccedil;in bir&amp;ccedil;ok şey yapmak gerekliydi, etkinliklere katılmak, uygulama geliştirmek kısacası tam anlamıyla Microsoft'un bizden beklediği "Aktif" olmaktı.Elimden geldiğince b&amp;uuml;t&amp;uuml;n etkinlikler eğitimlere katıldım &amp;ccedil;&amp;uuml;nk&amp;uuml; MSP se&amp;ccedil;ilemediğim taktirde bir daha bu t&amp;uuml;r ortamlarda bulunma ihtimalim de olduk&amp;ccedil;a az olabilirdi.Neyse ki sonunda MSP başvuruları ile ilgili e-mail geldi ve aynı form'u yeniden doldurup programa başvurmamız istendi ve tabi birde video :/ Yaklaşık 30-40 denemenin sonucunda 2,5 dkkalık bir MSP başvuru videosu &amp;ccedil;ektim ve link'ini Microsoft'a g&amp;ouml;nderdim. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&lt;span style="font-size: medium;" data-mce-mark="1"&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;Ge&amp;ccedil;en hafta 13 haziran Perşembe g&amp;uuml;n&amp;uuml; Mustafa Kasap hocamızdan aldığım mail ile MSP se&amp;ccedil;ilmiştim. Aslında pekte şaşırmamıştım &amp;ccedil;&amp;uuml;nk&amp;uuml; tam anlamıyla bir Candidate'dim&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce_3_5_8/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;yani normal şartlar altında se&amp;ccedil;ilmem gerekir diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yordum ve &amp;ccedil;ok ş&amp;uuml;k&amp;uuml;r ki &amp;ouml;yle de oldu&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce_3_5_8/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="color: #ff0000;"&gt;&lt;strong&gt;&lt;span style="font-size: medium;"&gt;Candidate'lik s&amp;uuml;resince neler yaptım, bana neler kattı ;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Bir&amp;ccedil;ok etkinliğe ve eğitime katıldım,&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Microsoft Ofiste Tunus'tan gelen MSP arkadaşları misafir edip onlarla tanışma fırsatım oldu,&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Şubat ayı i&amp;ccedil;erisinde Microsoft T&amp;uuml;rkiye A&amp;ccedil;ıkAkademi'nin d&amp;uuml;zenlediği Windows Phone Uygulama Geliştirme Yarışmasına katıldım ve 1 adet Nokia Lumia 800 Cep Telefonu kazandım,&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Ee tabi telefonu aldıktan sonra bi gaza gelmeler oldu ve yaklaşık 2,5 ay i&amp;ccedil;erisinde 15 adet Windows Phone uygulaması geliştirdim ve markete yolladım,&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Geliştirdiğim uygulamalar sayesinde biraz tanınmış olacam ki şu anda T&amp;uuml;rkiye'de bulunan &amp;ccedil;eşitli firmaların IT &amp;ccedil;alışanlarından e-mailler almaya başladım ve Windows Phone ile ilgili sorularını yanıtladım,&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Ben Candidate'ken MSP programında bulunan arkadaşların &amp;uuml;zerinde &amp;ccedil;alıştığı bir proje vardı ve bir gece yarısı gelen email'de projede bir kişi eksik olduğu ve g&amp;ouml;n&amp;uuml;ll&amp;uuml; katılacak bir kişi aradıkları yazıyordu, bende hi&amp;ccedil; teredd&amp;uuml;t etmeden cvp yazdım ve yaklaşık 20-25 kişiyle birlikte bir Microsoft Projesinde g&amp;ouml;rev alma şansım oldu.Proje hakkında pek bilgi veremiyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; hen&amp;uuml;z duyurulmuş bir şey değil :)&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Biz &amp;ouml;ğrencilerin baş belası Cv'lerimizi doldururken i&amp;ccedil;inde bu tarz şeylerin olması inanın hayatında şimdiye kadar &amp;ccedil;ok sağlam 3 şirkette m&amp;uuml;lakata girmiş birisi olarak s&amp;ouml;yl&amp;uuml;yorum bir&amp;ccedil;ok şirket i&amp;ccedil;in b&amp;uuml;y&amp;uuml;k &amp;ouml;nem taşıyor ve firmaların dikkatini &amp;ccedil;ekiyor,&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;Geliştirdiğim Windows Phone uygulamaları sayesinde, ge&amp;ccedil;en yıl bu zamanlar "&lt;span style="font-size: medium;"&gt;keşke bu şirkette &amp;ccedil;alışabilsem...&lt;/span&gt;" dediğim o şirket başta olmak &amp;uuml;zere birka&amp;ccedil; &amp;uuml;st d&amp;uuml;zey firmadan iş teklifleri alma şansım oldu ama istenilen değilde istediğim yerde &amp;ccedil;alışmayı tercih ettiğimden şimdilik o teklifleri askıya aldım,&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt; ve daha nicesi...&lt;/span&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Kısacası MSP olmak ve bu&amp;nbsp;community'nin i&amp;ccedil;erisinde bulunmak harika bir deneyim oldu benim i&amp;ccedil;in ve olmaya da devam ediyor..&lt;/span&gt;&lt;/p&gt;</content>
  <ispublished>True</ispublished>
  <isdeleted>False</isdeleted>
  <iscommentsenabled>True</iscommentsenabled>
  <pubDate>2013-06-18 20:29:00</pubDate>
  <lastModified>2020-01-20 08:22:32</lastModified>
  <raters>20</raters>
  <rating>2.199999</rating>
  <slug>Microsoft-Student-Partner-Programı</slug>
  <tags>
    <tag>MSP</tag>
    <tag>MicrosoftStudent Partner</tag>
    <tag>StudentPartner</tag>
  </tags>
  <comments />
  <categories>
    <category>5660c93a-7f12-4fdb-9aba-b7a2b128029f</category>
  </categories>
  <notifications />
</post>